In [13]:
import pandas as pd
import numpy as np

In [81]:
np.random.seed(10)
paises = {
    "Pais":["peru","italia","venezuela","colombia"],
    "Capital":["lima","roma","carabaivo","telefe"],
    "Superficie":list(np.random.rand(4))
}

In [83]:
pd.DataFrame(paises)

        Pais    Capital  Superficie
0       peru       lima    0.771321
1     italia       roma    0.020752
2  venezuela  carabaivo    0.633648
3   colombia     telefe    0.748804

In [84]:
personas = {
    "familia": [
        {"nombre": "Pedro", "edad": 40},
        {"nombre": "Luc√≠a", "edad": 35}
    ]
}
nuevo=pd.DataFrame(personas["familia"])
nuevo

  nombre  edad
0  Pedro    40
1  Luc√≠a    35

In [85]:
inventario = {
    "Luna": {"cantidad": 12, "precio": 125},
    "Lunas": {"cantidad": 12, "precio": 125},
    "Lunass": {"cantidad": 12, "precio": 125},
}
inventario["gasolina"]=[5,14.2]
inventario["gasolina"]=[15,14.2]
inventarios =pd.DataFrame(inventario , index=["cantidad","precio"])

In [86]:
def crear_Producto(nombre,cantidad, precio):
    if nombre in inventarios:
        print("ya existe")
    else:
        inventarios[nombre]=[cantidad,precio]
        print(inventario)

In [87]:
crear_Producto("mantequilla",15,12.2)
inventarios

{'Luna': {'cantidad': 12, 'precio': 125}, 'Lunas': {'cantidad': 12, 'precio': 125}, 'Lunass': {'cantidad': 12, 'precio': 125}, 'gasolina': [15, 14.2]}

          Luna  Lunas  Lunass  gasolina  mantequilla
cantidad    12     12      12      15.0         15.0
precio     125    125     125      14.2         12.2

In [60]:
def ver_producto(nombre):
    if nombre in inventarios:
        cantidad , precio = inventarios[nombre]
        print(f"{cantidad} , {precio}")
    else:
        print("no encontrado")
 
def ver_todo():
    for _ , datos in inventarios.items():
        print(f"{datos[0],{datos[1]}}")

In [54]:
ver_todo()

(12, {125})
(12, {125})
(12, {125})
(15.0, {14.2})
(15.0, {12.2})

C:\Users\User\AppData\Local\Temp\ipykernel_22972\78885453.py:10: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f"{datos[0],{datos[1]}}")

In [55]:
def actualizar(nombre,cantidad:None,precio=None):
    if cantidad is not None:
        inventarios[nombre][0]= cantidad
    if precio is not None:
        inventarios[nombre][0]= precio
        print("actualizado")
    else:
        print("no existe")

In [56]:
def eliminar(nombre):
    if nombre in inventarios:
        del inventarios[nombre]
        print(f"üóëÔ∏è Producto '{nombre}' eliminado.")
    else:
        print("no encontrado")

In [65]:

ver_producto("mantequilla")


ver_todo()


actualizar("mantequilla",cantidad=15)
ver_producto("gasolina")

eliminar("mantequilla")
ver_producto("mantequilla")

15.0 , 12.2
(12, {125})
(12, {125})
(12, {125})
(15.0, {12.2})
no existe
no encontrado
üóëÔ∏è Producto 'mantequilla' eliminado.
no encontrado

C:\Users\User\AppData\Local\Temp\ipykernel_22972\78885453.py:10: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(f"{datos[0],{datos[1]}}")
C:\Users\User\AppData\Local\Temp\ipykernel_22972\2373157044.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  inventarios[nombre][0]= cantidad
C:\Users\User\AppData\Local\Temp\ipykernel_22972\2373157044.py:3: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  inventarios[nombre][0]= cantidad

In [99]:
empleados = {
    "E001": {"nombre": "Carlos", "edad": 30},
    "E002": {"nombre": "Laura", "edad": 25}
}

df =pd.DataFrame.from_dict(empleados ,orient="index")

In [101]:
print(df.loc[["E001"]].to_string())  # Muestra los datos de Carlos

      nombre  edad
E001  Carlos    30

In [102]:
coordenadas = {
    (10, 20): "A",
    (15, 25): "B"
}

In [119]:
print(coordenadas.items())
dfs=pd.DataFrame(coordenadas.items(),columns=["Coordenadas","valor"])
print(dfs)
dfs[["fila","columna"]] = pd.DataFrame(dfs["Coordenadas"].tolist(), index=dfs.index)
dfs = dfs[['fila', 'columna', 'valor']]
dfs

dict_items([((10, 20), 'A'), ((15, 25), 'B')])
  Coordenadas valor
0    (10, 20)     A
1    (15, 25)     B

   fila  columna valor
0    10       20     A
1    15       25     B

In [128]:
info_paiss ={
    "Pais":["peru","chile","argentina","francia"],
    "Capital":["lima","santiago","buenos aires","paris"],
    "Superficie":list(np.arange(1,5)),
}

paisess = pd.DataFrame(info_paiss)
paisess

        Pais       Capital  Superficie
0       peru          lima           1
1      chile      santiago           2
2  argentina  buenos aires           3
3    francia         paris           4

In [132]:
assert len(paisess)==4

In [ ]:
assert paisess.query("edad")

In [159]:
df = pd.DataFrame({
    "Nombre": ["Ana", "Luis", "Pedro", "Marta"],
    "Edad": [23, 35, 30, 18],
    "Ciudad": ["Lima", "Bogot√°", "Madrid", "Lima"]
})

In [147]:
assert len(df)==4

In [160]:
edades = df.loc[df["Edad"]>20,"Edad"]
edades

0    23
1    35
2    30
Name: Edad, dtype: int64

In [163]:
df

  Nombre  Edad  Ciudad
0    Ana    23    Lima
1   Luis    35  Bogot√°
2  Pedro    30  Madrid
3  Marta    18    Lima

In [164]:
df.set_index("Nombre")

        Edad  Ciudad
Nombre
Ana       23    Lima
Luis      35  Bogot√°
Pedro     30  Madrid
Marta     18    Lima

In [169]:
edad = df.loc[df["Edad"]>20,["Nombre","Ciudad"]]
edad

  Nombre  Ciudad
0    Ana    Lima
1   Luis  Bogot√°
2  Pedro  Madrid

In [171]:
nombres = df.loc[df["Nombre"]=="Luis"].values
nombres

array([['Luis', 35, 'Bogot√°']], dtype=object)

In [178]:
ciudades = df.loc[df["Ciudad"]=="Lima"].sum()
ciudades

Nombre    AnaMarta
Edad            41
Ciudad    LimaLima
dtype: object

In [228]:
import numpy as np
registros = pd.DataFrame({"Nombre": ["Ana", "Luis", "Mar√≠a", "Pedro", "Luc√≠a"],
    "Edad": [25, 19, 30, 22, 18],
    "Ciudad": ["Lima", "Arequipa", "Lima", "Cusco", "Lima"],
    "Puntaje": [14, 9, 18, 12, 17]
})
registros.head(3)

  Nombre  Edad    Ciudad  Puntaje
0    Ana    25      Lima       14
1   Luis    19  Arequipa        9
2  Mar√≠a    30      Lima       18

In [230]:
registros["Nombre"].to_list()

['Ana', 'Luis', 'Mar√≠a', 'Pedro', 'Luc√≠a']

In [215]:
promedio = registros["Edad"].mean()
promedio

2.5

In [223]:
lima = registros.loc[registros["Ciudad"]=="lima"]
lima

  Nombre  Edad Ciudad  Puntaje
0   peru     1   lima        1

In [231]:
registros["Edad_doble"]= registros["Edad"]*2
registros

  Nombre  Edad    Ciudad  Puntaje  Edad_doble
0    Ana    25      Lima       14          50
1   Luis    19  Arequipa        9          38
2  Mar√≠a    30      Lima       18          60
3  Pedro    22     Cusco       12          44
4  Luc√≠a    18      Lima       17          36

In [233]:
registros["Ciudad"]= registros["Ciudad"].replace("Lima","Arequipa")
registros

  Nombre  Edad    Ciudad  Puntaje  Edad_doble
0    Ana    25  Arequipa       14          50
1   Luis    19  Arequipa        9          38
2  Mar√≠a    30  Arequipa       18          60
3  Pedro    22     Cusco       12          44
4  Luc√≠a    18  Arequipa       17          36

In [237]:
df_ordenado = registros.sort_values(by="Puntaje", ascending=False)
df_ordenado

  Nombre  Edad    Ciudad  Puntaje  Edad_doble
2  Mar√≠a    30  Arequipa       18          60
4  Luc√≠a    18  Arequipa       17          36
0    Ana    25  Arequipa       14          50
3  Pedro    22     Cusco       12          44
1   Luis    19  Arequipa        9          38

In [239]:
registros.drop("Edad_doble" , axis=1 ,inplace=True)
registros

  Nombre  Edad    Ciudad  Puntaje
0    Ana    25  Arequipa       14
1   Luis    19  Arequipa        9
2  Mar√≠a    30  Arequipa       18
3  Pedro    22     Cusco       12
4  Luc√≠a    18  Arequipa       17

In [244]:
registros.rename(columns={"Puntaje":"Calificacion"},inplace=True)
registros

  Nombre  Edad    Ciudad  Calificacion
0    Ana    25  Arequipa            14
1   Luis    19  Arequipa             9
2  Mar√≠a    30  Arequipa            18
3  Pedro    22     Cusco            12
4  Luc√≠a    18  Arequipa            17

In [246]:
registros.groupby("Ciudad")["Edad"].mean()

Ciudad
Arequipa    23.0
Cusco       22.0
Name: Edad, dtype: float64

In [247]:
registros.groupby("Ciudad")["Nombre"].count()

Ciudad
Arequipa    4
Cusco       1
Name: Nombre, dtype: int64

In [252]:
p = registros["Calificacion"].mean()

In [257]:
nuevo = registros.loc[registros["Calificacion"]>p,"Nombre"].count
nuevo

<bound method Series.count of 2    Mar√≠a
4    Luc√≠a
Name: Nombre, dtype: object>

In [259]:
registros["APROBADOS"] = registros["Calificacion"].apply(lambda x : "Si" if x>=13 else "No" )
registros

  Nombre  Edad    Ciudad  Calificacion APROBADOS
0    Ana    25  Arequipa            14        Si
1   Luis    19  Arequipa             9        No
2  Mar√≠a    30  Arequipa            18        Si
3  Pedro    22     Cusco            12        No
4  Luc√≠a    18  Arequipa            17        Si

In [261]:
registros.isnull().sum()

Nombre          0
Edad            0
Ciudad          0
Calificacion    0
APROBADOS       0
dtype: int64

In [270]:
data = np.random.randint(1,17,size=(4,4))
dfss = pd.DataFrame(data , columns=["a","b","c","d"])
dfss

    a  b   c   d
0   1  3   4  15
1  16  4  12   3
2  15  7  14  11
3  12  1   6  14

In [275]:
datos = dfss["b"].values
datos

array([3, 4, 7, 1])

In [277]:
media = dfss.mean()
media

a    11.00
b     3.75
c     9.00
d    10.75
dtype: float64